# Reshaping and tidy data

Documentations sources

* [Hadley Wickham. Tidy Data](http://vita.had.co.nz/papers/tidy-data.pdf)
* https://tomaugspurger.github.io/modern-5-tidy
* http://matthewrocklin.com/blog/work/2015/06/18/Categoricals
* http://pandas.pydata.org/pandas-docs/version/0.18.0/categorical.html

## I. Philosophy behind tidy data

* Data to be processed is rarely in the correct format for the analysis
* One must reshape the data before it is in the convenient form for the analysis
* Tidy data is a dataset where
  
  * Each observed variable is a column of a data frame
  * Each observation form a row of a data frama
  * Each type of observational unit forms a data frame
  
* To illustrate the last condition consider observational units of a supermarket data:
  
  * information about the buyer
  * time and payent type of a particular transaction
  * individual items in the transaction including deductions

* If we are interested who buys beer and when then age, gender and item type must be in the data frame
* If we are interested how much a demographic segment buys on average and when then only age, gender, time and sum must be kept
* If we are doing more complex behavioral analysis then we need two data frames:
   * One for describing persons.
   * The other for describing purchases of individuals.

In [115]:
import numpy as np
import pandas as pd
from pandas import DataFrame
from pandas import read_csv
from pandas import melt

## I. How to melt wide tables

* It is quite common that some column header represent value not variable names
* For instance, some columns indicate dates or subpopulations 
* To tidy up this data, the table must be melted into long format
* This can be achieved with `melt` function 
  * `id_vars`    -- columns to be preserved as they are
  * `value_vars` -- columns to be converted to value (usually not needed)
  * `var_name`   -- name of the new variable
  * `value_name` -- name of the observed value
  * `col_level`  -- which multi-index levels to use 
* If the column index is a multi-index then we can specify which levels to keep but this can lead to information loss

In [152]:
# Melt a wide table with a single header row
display(read_csv('estonian_population_1.csv', header = None).head())
df = read_csv('estonian_population_1.csv')
display(df.head())

# Select all years for melting
display(melt(df, id_vars=['Age', 'Gender'], var_name = 'Year', value_name = 'Count').tail())

# Select only years 1950 - 1951 for melting 
display(melt(df, id_vars=['Age', 'Gender'], var_name = 'Year', value_vars = ['1950', '1951'],  value_name = 'Count').tail())

# Melt a table with many header rows 
display(read_csv('estonian_population_2.csv', header = None).head())

# As the Age column is wrongly named we push it into the index 
df = read_csv('estonian_population_2.csv', header = [0,1], index_col = 0)
display(df.head())
display(melt(df, value_name = 'Count').reset_index().rename(columns = {'index': 'Age'}).head())

# It is possible to use only Gender and Year levels but this causes information loss
display(melt(df, col_level = 'Gender', value_name = 'Count').head())
display(melt(df, col_level = 'Year', value_name = 'Count').head())

,0,1,2,3,4,5,6,7,8,9,...,42,43,44,45,46,47,48,49,50,51
0,Age,Gender,1950,1951,1952,1953,1954,1955,1956,1957,...,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999
1,0,All,19310,18841,19356,19563,19239,20441,20038,19242,...,24006,22041,18956,17571,14794,13760,13192,12981,12326,11911
2,0,Female,9303,9042,9298,9458,9260,9835,9784,9326,...,11637,10689,9224,8545,7116,6756,6430,6320,5931,5761
3,0,Male,10007,9799,10058,10105,9979,10606,10254,9916,...,12369,11352,9732,9026,7678,7004,6762,6661,6395,6150
4,1,All,18162,18251,17743,18368,19069,18473,19534,19631,...,24542,23858,21841,18506,17332,14589,13602,13053,12839,12178

,Age,Gender,1950,1951,1952,1953,1954,1955,1956,1957,...,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999
0,0,All,19310,18841,19356,19563,19239,20441,20038,19242,...,24006,22041,18956,17571,14794,13760,13192,12981,12326,11911
1,0,Female,9303,9042,9298,9458,9260,9835,9784,9326,...,11637,10689,9224,8545,7116,6756,6430,6320,5931,5761
2,0,Male,10007,9799,10058,10105,9979,10606,10254,9916,...,12369,11352,9732,9026,7678,7004,6762,6661,6395,6150
3,1,All,18162,18251,17743,18368,19069,18473,19534,19631,...,24542,23858,21841,18506,17332,14589,13602,13053,12839,12178
4,1,Female,8856,8889,8609,8910,9291,8939,9473,9644,...,12179,11577,10587,8995,8441,7019,6686,6372,6253,5855

       Age  Gender  Year  Count
12745   83  Female  1999   2817
12746   83    Male  1999    950
12747   84     All  1999   3924
12748   84  Female  1999   3002
12749   84    Male  1999    922

     Age  Gender  Year  Count
505   83  Female  1951   1099
506   83    Male  1951    466
507   84     All  1951   1484
508   84  Female  1951   1072
509   84    Male  1951    412

,0,1,2,3,4,5,6,7,8,9,...,141,142,143,144,145,146,147,148,149,150
0,Year,1950,1950,1950,1951,1951,1951,1952,1952,1952,...,1996,1997,1997,1997,1998,1998,1998,1999,1999,1999
1,Gender,All,Female,Male,All,Female,Male,All,Female,Male,...,Male,All,Female,Male,All,Female,Male,All,Female,Male
2,0,19310,9303,10007,18841,9042,9799,19356,9298,10058,...,6762,12981,6320,6661,12326,5931,6395,11911,5761,6150
3,1,18162,8856,9306,18251,8889,9362,17743,8609,9134,...,6916,13053,6372,6681,12839,6253,6586,12178,5855,6323
4,2,16928,8178,8750,18209,8863,9346,18295,8882,9413,...,7505,13487,6628,6859,12946,6326,6620,12746,6210,6536

Year     1950                 1951                1952                 1953  \
Gender    All Female   Male    All Female  Male    All Female   Male    All
0       19310   9303  10007  18841   9042  9799  19356   9298  10058  19563
1       18162   8856   9306  18251   8889  9362  17743   8609   9134  18368
2       16928   8178   8750  18209   8863  9346  18295   8882   9413  17744
3       16540   8117   8423  17059   8274  8785  18271   8919   9352  18355
4       13620   6680   6940  16735   8201  8534  17211   8343   8868  18368

Year    ...   1996   1997                1998                1999
Gender  ...   Male    All Female  Male    All Female  Male    All Female  Male
0       ...   6762  12981   6320  6661  12326   5931  6395  11911   5761  6150
1       ...   6916  13053   6372  6681  12839   6253  6586  12178   5855  6323
2       ...   7505  13487   6628  6859  12946   6326  6620  12746   6210  6536
3       ...   8705  14375   6926  7449  13414   6598  6816  12868   6292  6576
4       ...   9101  16863   8225  8638  14317   6904  7413  13329   6562  6767

[5 rows x 150 columns]

   Age  Year Gender  Count
0    0  1950    All  19310
1    1  1950    All  18162
2    2  1950    All  16928
3    3  1950    All  16540
4    4  1950    All  13620

  Gender  Count
0    All  19310
1    All  18162
2    All  16928
3    All  16540
4    All  13620

   Year  Count
0  1950  19310
1  1950  18162
2  1950  16928
3  1950  16540
4  1950  13620

## II. What to do when a column encodes several variables

* Sometimes a value in a table encodes several variables
* In the simplest case, this information is encoded into the value:
  * Age groups `M11-15`, `F11-15`, `M16-20`,...
  * Codes of time periods `2012Q1`, `2012-01-01 10:30`
  * International phone numbers `<country> <number>`
* Then string manipulation functions become handy
* In complex cases, the information is external or must be manually added:
  * Item codes in supermarket date can be divided into food groups
  * Billed sum is different currencies but the currency information is lost
* The last example is quite hard to handle: 
  * If there is a pricelist then currency can be deduced 
  * If there is a persons IP address then currency can be deduced form the approximate geographical location
  * The latter is heuristic and requires a lot of manual work

In [174]:
df = read_csv('pricelist.csv')
df.head(10)

,Motherboard,CPU socket,Form factor,RAM slots,Max RAM,Price
0,Asus Prime Z370-A,LGA1151,ATX,4,64 GB,$173.98
1,MSI B350 PC MATE,AM4,ATX,4,64 GB,$85.49
2,MSI Z370-A PRO,LGA1151,ATX,4,64 GB,$109.99
3,Gigabyte B450M DS3H,AM4,Micro ATX,4,64 GB,$76.88
4,MSI B450 TOMAHAWK,AM4,ATX,4,64 GB,$110.33
5,Asus ROG STRIX Z390-E GAMING,LGA1151,ATX,4,64 GB,$235.99
6,Asus STRIX B350-F GAMING,AM4,ATX,4,64 GB,$115.53
7,Asus ROG STRIX B450-F GAMING,AM4,ATX,4,64 GB,$129.00
8,ASRock B450M-HDV,AM4,Micro ATX,2,32 GB,$79.89
9,Gigabyte X470 AORUS ULTRA GAMING,AM4,ATX,4,64 GB,$119.99

### String manipulation

* Pandas provides a powerful toolset for string manipulation.
* All of them go through `str` attribute that provides vectorized string operations 
  * `str[a:b]` -- shorcut for substring selection
  * `str.strip` -- remove leading and trailing whitespaces or other characters
  * `str.split` -- split string based on separator pattern 
  * `str.extract` -- extracts the first substring corresponding to a regex pattern
  * `str.extractall` -- extracts all substrings corresponding to a regex pattern
  * `str.findall` -- find all occurences of a regular expression
  * `str.contains` -- detects if a string contains a regular expression
  * `str.matches` -- detects if regular expression matches string 
  * `str.replace` -- replaces a regex pattern with new text
  
* The complete list of operations with further details can be found  
  * https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html
* Most advanced operations require knowledge of regex patterns
  * https://docs.python.org/3.5/howto/regex.html
  * https://www.tutorialspoint.com/python/python_reg_expressions.htm
  * https://www.datacamp.com/community/tutorials/python-regular-expression-tutorial
* Key things to remember about regexes:
  * Raw strings `r'<text>'` make regex writing and reading tracktable
  * There are wildcards for important patterns: whitespaces, numbers, dates etc
  * Syntax `(?P<name>...)` allows to name capture groups
  * Syntax `(?:...)` allows to drop a capture group
  * Symbols `*`, `+`, `?` allow to specify optional parts of the pattern
  * Capture groups `\<number>` and `\g<name>` can be referenced in a replacement pattern

In [282]:
# Simple substring selection to drop dollar sign
display(df.assign(Price = df['Price'].str[1:].astype(float)).head())

# Using right strip to drop GB at the end. Bonus how to assign to column with whitespace
display(df.assign(**{'Max RAM': df['Max RAM'].str.rstrip('GB').astype(float)}).head())

# Split the column and join it with the original data frame
display(df.join(df['Max RAM'].str.split(expand = True)
                .rename(columns = {0: 'Max RAM size', 1:'Max RAM Unit'}))
        .drop(columns=['Max RAM']).head())

           Motherboard CPU socket Form factor  RAM slots Max RAM   Price
0    Asus Prime Z370-A    LGA1151         ATX          4   64 GB  173.98
1     MSI B350 PC MATE        AM4         ATX          4   64 GB   85.49
2       MSI Z370-A PRO    LGA1151         ATX          4   64 GB  109.99
3  Gigabyte B450M DS3H        AM4   Micro ATX          4   64 GB   76.88
4    MSI B450 TOMAHAWK        AM4         ATX          4   64 GB  110.33

           Motherboard CPU socket Form factor  RAM slots  Max RAM    Price
0    Asus Prime Z370-A    LGA1151         ATX          4     64.0  $173.98
1     MSI B350 PC MATE        AM4         ATX          4     64.0   $85.49
2       MSI Z370-A PRO    LGA1151         ATX          4     64.0  $109.99
3  Gigabyte B450M DS3H        AM4   Micro ATX          4     64.0   $76.88
4    MSI B450 TOMAHAWK        AM4         ATX          4     64.0  $110.33

,Motherboard,CPU socket,Form factor,RAM slots,Price,Max RAM size,Max RAM Unit
0,Asus Prime Z370-A,LGA1151,ATX,4,$173.98,64,GB
1,MSI B350 PC MATE,AM4,ATX,4,$85.49,64,GB
2,MSI Z370-A PRO,LGA1151,ATX,4,$109.99,64,GB
3,Gigabyte B450M DS3H,AM4,Micro ATX,4,$76.88,64,GB
4,MSI B450 TOMAHAWK,AM4,ATX,4,$110.33,64,GB

In [291]:
# Use complex regex pattern to split motherboard typo into company, model and modifier columns
regex = r'(?P<Company>.*)\s(?P<Model>[A-Z]*[0-9]+(?:-?[A-Z])*)(?:\s(?P<Modifier>.*))?'
display(df['Motherboard'].str.extract(regex)
        .replace({pd.np.nan: ''})
        .join(df)
        .drop(columns = 'Motherboard').head())

# Find all motherboards intended for gaming
display(df.assign(For_gaming = df['Motherboard'].str.contains(r'GAMING')).head())

# Replace GAMING, ULTRA, PRO, PLUS  with +
display(df.assign(Motherboard = df['Motherboard'].str.replace(r'(GAMING|ULTRA|PRO|PLUS\s+)+', '+')).head())

,Company,Model,Modifier,CPU socket,Form factor,RAM slots,Max RAM,Price
0,Asus Prime,Z370-A,,LGA1151,ATX,4,64 GB,$173.98
1,MSI,B350,PC MATE,AM4,ATX,4,64 GB,$85.49
2,MSI,Z370-A,PRO,LGA1151,ATX,4,64 GB,$109.99
3,Gigabyte B450M,DS3H,,AM4,Micro ATX,4,64 GB,$76.88
4,MSI,B450,TOMAHAWK,AM4,ATX,4,64 GB,$110.33

,Motherboard,CPU socket,Form factor,RAM slots,Max RAM,Price,For_gaming
0,Asus Prime Z370-A,LGA1151,ATX,4,64 GB,$173.98,False
1,MSI B350 PC MATE,AM4,ATX,4,64 GB,$85.49,False
2,MSI Z370-A PRO,LGA1151,ATX,4,64 GB,$109.99,False
3,Gigabyte B450M DS3H,AM4,Micro ATX,4,64 GB,$76.88,False
4,MSI B450 TOMAHAWK,AM4,ATX,4,64 GB,$110.33,False

           Motherboard CPU socket Form factor  RAM slots Max RAM    Price
0    Asus Prime Z370-A    LGA1151         ATX          4   64 GB  $173.98
1     MSI B350 PC MATE        AM4         ATX          4   64 GB   $85.49
2         MSI Z370-A +    LGA1151         ATX          4   64 GB  $109.99
3  Gigabyte B450M DS3H        AM4   Micro ATX          4   64 GB   $76.88
4    MSI B450 TOMAHAWK        AM4         ATX          4   64 GB  $110.33

## III. What to do if an observation is described by several rows   

* Programmers lik key-value tables as you can put anything into it 
* Data anlalysists hate them as you can put anything into it
* Such tables must be converted back to more wider format as follows
   * Create a multi-index defining a single observation
   * Use `unstack` to push part of the multi-index to column index 
   * Clean up all indices to restore status quo using `reset_index` and `columns.droplevel`

In [439]:
# Lets create a simple key-value table 
df = read_csv('pricelist.csv')
df.index.name = 'row_id'
df = df.reset_index()
df = melt(df, id_vars = 'row_id')

# Each potential purchase is defined by six rows
display(df.sort_values(['row_id', 'variable']).head(12))

# Idiomatic way to widen the table
df = df.set_index(['row_id', 'variable']).unstack().reset_index(drop=True)
df.columns = df.columns.droplevel(0)
display(df.head())

     row_id     variable              value
40        0   CPU socket            LGA1151
80        0  Form factor                ATX
160       0      Max RAM              64 GB
0         0  Motherboard  Asus Prime Z370-A
200       0        Price            $173.98
120       0    RAM slots                  4
41        1   CPU socket                AM4
81        1  Form factor                ATX
161       1      Max RAM              64 GB
1         1  Motherboard   MSI B350 PC MATE
201       1        Price             $85.49
121       1    RAM slots                  4

variable,CPU socket,Form factor,Max RAM,Motherboard,Price,RAM slots
0,LGA1151,ATX,64 GB,Asus Prime Z370-A,$173.98,4
1,AM4,ATX,64 GB,MSI B350 PC MATE,$85.49,4
2,LGA1151,ATX,64 GB,MSI Z370-A PRO,$109.99,4
3,AM4,Micro ATX,64 GB,Gigabyte B450M DS3H,$76.88,4
4,AM4,ATX,64 GB,MSI B450 TOMAHAWK,$110.33,4

## IV. Dataframe contains duplicated field values 

* A row in a data frame can be combination of several independent facts
* If one of these facts is reoccuring in many rows then the dataframe must be decomposed
* To do that a data frame must be split so that all parts have the same index:
  * Create unique index for joining: `df.groupby(column_list).ngroup()`  
  * Selects relevant columns: `df[column_list]`   
  * Drop repeating rows:  `drop_duplicates` 
  * adds index for combining the data: `set_index`
* Index creation can be dropped if there already exists a good key column  
* Decomposition may reveal errors and inconsistencies of the data
* Later on the data might be joined again but then in a controlled way for particular purpose

In [440]:
df = read_csv('billboard.csv')
display(df.head())
display(df.loc[df['song'] =='Havana', :].head())

,week,position,performer,song,instance,previous_position,peak_position,weeks_on_chart
0,2018-01-06,1,Ed Sheeran,Perfect,2,1,1,17
1,2018-01-06,2,Post Malone Featuring 21 Savage,Rockstar,1,2,1,14
2,2018-01-06,3,Camila Cabello Featuring Young Thug,Havana,2,3,2,19
3,2018-01-06,4,G-Eazy Featuring A$AP Rocky & Cardi B,No Limit,1,5,4,15
4,2018-01-06,5,Imagine Dragons,Thunder,1,6,4,34

,week,position,performer,song,instance,previous_position,peak_position,weeks_on_chart
2,2018-01-06,3,Camila Cabello Featuring Young Thug,Havana,2,3,2,19
101,2018-01-13,2,Camila Cabello Featuring Young Thug,Havana,2,3,2,20
201,2018-01-20,2,Camila Cabello Featuring Young Thug,Havana,2,2,2,21
300,2018-01-27,1,Camila Cabello Featuring Young Thug,Havana,2,2,1,22
402,2018-02-03,3,Camila Cabello Featuring Young Thug,Havana,2,1,1,23

* Values in the columns `song` and `performer` are repeated over and over
* Values in the columns `peak_position` and `weeks_on_chart` are computable form other data
* Computable fields are common source of errors and inconsistencies
* We keep them only because the data contains charts from 2018 only and we cannot recompute them

In [441]:
# Lets add a song_id for joining the data later on 
df['song_id'] = df.groupby(['performer','song']).ngroup()

# Extract data about performers 
songs = (df[['song_id', 'performer', 'song']]
         .drop_duplicates()
         .set_index('song_id')
         .sort_values('song_id')) 
display(songs.head())

# Extract data about chart itself
charts = (df[['week', 'position', 'song_id', 'instance', 'previous_position', 'peak_position', 'weeks_on_chart']]
         .set_index('song_id'))

display(charts.head())

# Decomposition can be reversed with join or merge methods
display(charts.join(songs).sort_values(['week', 'position']).head())
display(charts.reset_index().merge(songs.reset_index(), on = 'song_id').sort_values(['week', 'position']).head())

                              performer           song
song_id
0        2 Chainz Featuring YG & Offset          Proud
1               2 Chainz, Drake & Quavo   Bigger > You
2                             21 Savage   Bank Account
3                   5 Seconds Of Summer  Want You Back
4                   5 Seconds Of Summer     Youngblood

,week,position,instance,previous_position,peak_position,weeks_on_chart
song_id,,,,,,
176,2018-01-06,1,2,1,1,17
547,2018-01-06,2,1,2,1,14
83,2018-01-06,3,2,3,2,19
214,2018-01-06,4,1,5,4,15
240,2018-01-06,5,1,6,4,34

,week,position,instance,previous_position,peak_position,weeks_on_chart,performer,song
song_id,,,,,,,,
176,2018-01-06,1,2,1,1,17,Ed Sheeran,Perfect
547,2018-01-06,2,1,2,1,14,Post Malone Featuring 21 Savage,Rockstar
83,2018-01-06,3,2,3,2,19,Camila Cabello Featuring Young Thug,Havana
214,2018-01-06,4,1,5,4,15,G-Eazy Featuring A$AP Rocky & Cardi B,No Limit
240,2018-01-06,5,1,6,4,34,Imagine Dragons,Thunder

,song_id,week,position,instance,previous_position,peak_position,weeks_on_chart,performer,song
0,176,2018-01-06,1,2,1,1,17,Ed Sheeran,Perfect
40,547,2018-01-06,2,1,2,1,14,Post Malone Featuring 21 Savage,Rockstar
67,83,2018-01-06,3,2,3,2,19,Camila Cabello Featuring Young Thug,Havana
94,214,2018-01-06,4,1,5,4,15,G-Eazy Featuring A$AP Rocky & Cardi B,No Limit
108,240,2018-01-06,5,1,6,4,34,Imagine Dragons,Thunder

## V. Relevant data is skattered among several dataframes

* Different data frames can be joined based on key columns or indeces.
* If key columns are pushed to the index then `df.join` is appropriate:
  * Data frames inside the `df.join` call must have key columns as indices
  * Use `on` argument if key columns are outside of `df.index` 
  * Join type is deremnined by `how` argument
  * Arguments `lsuffix` and `rsuffix` are used disambiguate overlapping columns
* Otherwise `df.merge` is more appropriate. It is also more flexible:
  * Key columns can be named differently
  * Merge type can be validated
  
* Conatenation??

In [375]:
# Lets find the top place in 2018 for each performer

# Lets use join to merge the data 
df = charts.join(songs['performer'])[['performer', 'position']]
display(df.sort_values('performer').head())

# Lets compute the top position 
display(df.groupby('performer').min()
        .rename(columns = {'position': 'best_position'})
        .sort_values('best_position', ascending = True)
        .head())

# Lets count how many weeks the performer held the best position
df = df.groupby('performer').min().rename(columns = {'position': 'best_position'})
df = df.merge(charts.join(songs), left_on = ['performer', 'best_position'], right_on = ['performer', 'position'])

# Lets compute the answer by grouping
display(df[['performer', 'best_position']]
        .groupby('performer').count()
        .rename(columns = {'best_position': 'weeks'})
        .sort_values('weeks', ascending = False)
        .head())
        
# Lets investigate how many different songs each performer has on top places
df =(charts.join(songs['performer'])[['performer', 'position']]
     .groupby('performer').min()
     .rename(columns = {'position': 'best_position'}))
df = df.merge(charts.join(songs), left_on = ['performer', 'best_position'], right_on = ['performer', 'position'])
df = df[['performer', 'song']].drop_duplicates()

tmp = (df.groupby('performer').count()
       .sort_values('song', ascending = False)
       .reset_index()
       .rename(columns = {'song': 'hit_count'}))
       
display(tmp.merge(df, on = 'performer')
        .set_index('performer')
        .sort_values(['hit_count', 'performer', 'song'], ascending = False)
        .head(10))

                              performer  position
song_id
0        2 Chainz Featuring YG & Offset        96
0        2 Chainz Featuring YG & Offset        99
1               2 Chainz, Drake & Quavo        53
1               2 Chainz, Drake & Quavo        60
2                             21 Savage        28

                            best_position
performer
Ariana Grande                           1
Travis Scott                            1
Maroon 5 Featuring Cardi B              1
Drake                                   1
XXXTENTACION                            1

                            weeks
performer
Drake                          29
Bruno Mars & Cardi B            8
Maroon 5 Featuring Cardi B      7
Ariana Grande                   6
Charlie Puth                    5

                           hit_count                    song
performer
Drake                              3           Nice For What
Drake                              3          In My Feelings
Drake                              3              God's Plan
Luke Combs                         2  She Got The Best Of Me
Luke Combs                         2         One Number Away
twenty one pilots                  1                Jumpsuit
lovelytheband                      1                  Broken
Zedd, Maren Morris & Grey          1              The Middle
Zedd & Elley Duhe                  1               Happy Now
Zayn Featuring Sia                 1          Dusk Till Dawn

## VI. Enforce correctness by defining classifiers

* Normally cells in a dataframe have either a numeric value or are strings 
* If a cell in a column can have finite number potential values then it is a cathegorical value:
  * nominal values have no ordering such as location names
  * ordina values have some sort of linear order such as grades
* Pandas supports categorical data:
  * usage reduces memory footprint
  * allows to detect values that are outside the list
* It is possible to define nominal and ordinal categories
* Categorical data can be created in three ways
  * With class constuctor `Categorical(values, categories ...)` and assignment
  * By defining explicit category datatype `t = CategoricalDtype(value_list)` and then `astype` conversion function
  * Using `astype('category')` to convert data to cathegorical data
* The second method coverts values outside the category into `numpy.nan` values
  * Datatype `CategoricalDtype` documents what are possible values 
* Information about categories can be accessed with `.cat` property:
  * `cathegories` -- list of potential values
  * `as_ordered()` -- define order between potential values
  * `as_unordered()` -- define order between potential values
  * `add_catherories()` -- add new potential values
  * `remove_categories()` -- remove potential values
  * `remove_unused_categories()` -- remove unused categories
  

Categorical.from_codes  


  
  
>> t = CategoricalDtype(categories=['b', 'a'], ordered=True)
>>> pd.Series(['a', 'b', 'a', 'c'], dtype=t)


s.cat.categories = ["Group %s" % g for g in s.cat.categories]

Appending categories can be done by using the Categorical.add_categories() method:

Categorical.remove_categories(

s.cat.remove_unused_categories()
 s.cat.as_ordered()
 
 Categorical.reorder_categories(),
 
 pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section.

Missing values should not be included in the Categorical’s categories, only in the values. Instead, it is understood that NaN is different, and is always a possibility. When working with the Categorical’s codes, missing values will always have a code of -1.

In [460]:
# Convert 
df = songs.assign(performer = songs['performer'].astype('category')).head(20)
df['performer'].cat.categories

Index(['2 Chainz Featuring YG & Offset', '2 Chainz, Drake & Quavo',
       '21 Savage', '5 Seconds Of Summer', '6LACK Featuring J. Cole',
       '6ix9ine', '6ix9ine Featuring A Boogie Wit da Hoodie',
       '6ix9ine Featuring Anuel AA', '6ix9ine Featuring Bobby Shmurda',
       '6ix9ine Featuring DJ SPINKING',
       ...
       'Young Thug Featuring Nicki Minaj', 'YoungBoy Never Broke Again',
       'YoungBoy Never Broke Again Featuring Kevin Gates & Quando Rondo',
       'Zac Efron & Zendaya', 'Zayn', 'Zayn Featuring Sia',
       'Zedd & Elley Duhe', 'Zedd, Maren Morris & Grey', 'lovelytheband',
       'twenty one pilots'],
      dtype='object', length=446)

In [ ]:
s.astype("category", categories=["b","c","d"], ordered=False)
e from_codes()

In [453]:
tmp = songs['performer'].copy()
tmp = tmp.astype("category")
tmp.head()

song_id
0    2 Chainz Featuring YG & Offset
1           2 Chainz, Drake & Quavo
2                         21 Savage
3               5 Seconds Of Summer
4               5 Seconds Of Summer
Name: performer, dtype: category
Categories (446, object): [2 Chainz Featuring YG & Offset, 2 Chainz, Drake & Quavo, 21 Savage, 5 Seconds Of Summer, ..., Zedd & Elley Duhe, Zedd, Maren Morris & Grey, lovelytheband, twenty one pilots]

In [ ]:
Extracting substrings
str[0]
str.extract(r'([ab])(\d)', expand=False)
pd.Series(['a1', 'b2', 'c3']).str.extract(r'(?P<letter>[ab])(?P<digit>\d)',
   ....:                                           expand=False)

 pd.Series(['a1', 'b2', '3']).str.extract(r'([ab])?(\d)', expand=False)
 extractall 

str.contains(pattern)
str.match(pattern)
s.str.get_dummies(sep='|')
split()
rsplit()

In [150]:
melt(df, col_level = 'Gender').head()

  Gender  value
0    All  19310
1    All  18162
2    All  16928
3    All  16540
4    All  13620

In [102]:
df1.head()

#~df['Vanus'].isin(['Kokku', 'Vanus teadmata'])
#df.loc[df['Vanus'] != 'Kokku', ['Vanus', 'Sugu', 'TIME', 'Value']]

#df1.Age.astype(int)

,Age,Gender,1950,1951,1952,1953,1954,1955,1956,1957,...,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999
0,0,All,19310,18841,19356,19563,19239,20441,20038,19242,...,24006,22041,18956,17571,14794,13760,13192,12981,12326,11911
1,0,Female,9303,9042,9298,9458,9260,9835,9784,9326,...,11637,10689,9224,8545,7116,6756,6430,6320,5931,5761
2,0,Male,10007,9799,10058,10105,9979,10606,10254,9916,...,12369,11352,9732,9026,7678,7004,6762,6661,6395,6150
3,1,All,18162,18251,17743,18368,19069,18473,19534,19631,...,24542,23858,21841,18506,17332,14589,13602,13053,12839,12178
4,1,Female,8856,8889,8609,8910,9291,8939,9473,9644,...,12179,11577,10587,8995,8441,7019,6686,6372,6253,5855

In [1]:
## II. Concatenation and merging

In [ ]:
## II. Mapping and aggregation

In [276]:
%config IPCompleter.greedy=True

In [ ]:
pd.cut
reindex
reindex_like
rename
 -columns
 -rows
 -inplace
iteration
sorting
-index
-columns
-values
sort_values() provides a provision to choose the algorithm from mergesort,
heapsort and quicksort. Mergesort is the only stable algorithm.

string manipulation